using System.Text.Json;
using Relaks.Models;

namespace Relaks.Database.Seeders;

public partial class DatabaseSeeder
{
    
    private class ProfessionItem
    {
        public string Category { get; set; } = null!;
        public List<string> Items { get; set; } = new();
    }

    private void SeedProfessions()
    {
      var json = @"{
  ""Военные"": [
    ""Военнослужащий"",
    ""Конвоир"",
    ""Пожарный"",
    ""Разведчик"",
    ""Спасатель"",
    ""Телохранитель""
  ],
  ""Издательство и типография"": [
    ""Верстальщик"",
    ""Выпускающий редактор"",
    ""Дата-журналист"",
    ""Журналист"",
    ""Издатель"",
    ""Корректор"",
    ""Переплетчик"",
    ""Печатник"",
    ""Редактор"",
    ""Фальцовщик""
  ],
  ""Информатика и связь"": [
    ""HTML-верстальщик"",
    ""SMM-менеджер"",
    ""UX-дизайнер"",
    ""Web-интегратор"",
    ""Администратор базы данных"",
    ""Администратор сайта"",
    ""Аналитик Big Data"",
    ""Блогер"",
    ""Блокчейн-разработчик"",
    ""Веб-дизайнер"",
    ""Диктор"",
    ""Контент-менеджер"",
    ""Копирайтер"",
    ""Радиоведущий"",
    ""Сетевой инженер"",
    ""Системный администратор"",
    ""Системный аналитик"",
    ""Специалист по информационной безопасности"",
    ""Спичрайтер"",
    ""Тележурналист"",
    ""Тестировщик""
  ],
  ""Медицинские"": [
    ""Акушер"",
    ""Анестезиолог"",
    ""Врач скорой помощи"",
    ""Врач-диетолог"",
    ""Генетик"",
    ""Дерматолог"",
    ""Зубной техник"",
    ""Иммунолог"",
    ""Кардиолог"",
    ""Кардиохирург"",
    ""Косметолог"",
    ""Лаборант"",
    ""Логопед"",
    ""Массажист"",
    ""Медсестра"",
    ""Невропатолог"",
    ""Нейрохирург"",
    ""Онколог"",
    ""Офтальмолог"",
    ""Педиатр"",
    ""Психолог"",
    ""Психотерапевт"",
    ""Спортивный врач"",
    ""Стоматолог"",
    ""Терапевт"",
    ""Фармацевт"",
    ""Фельдшер""
  ],
  ""Научные"": [
    ""Археолог"",
    ""Архивариус"",
    ""Астроном"",
    ""Библиограф"",
    ""Биоинженер"",
    ""Биолог"",
    ""Биохимик"",
    ""Ботаник"",
    ""Вирусолог"",
    ""Востоковед"",
    ""Генный инженер"",
    ""Геолог"",
    ""Египтолог"",
    ""Искусствовед"",
    ""Историк"",
    ""Ихтиолог"",
    ""Конструктор"",
    ""Культуролог"",
    ""Лингвист"",
    ""Математик"",
    ""Метеоролог"",
    ""Микробиолог"",
    ""Наноинженер"",
    ""Нанотехнолог"",
    ""Орнитолог"",
    ""Палеонтолог"",
    ""Политолог"",
    ""Политтехнолог"",
    ""Почвовед"",
    ""Религиовед"",
    ""Социолог"",
    ""Философ"",
    ""Химик"",
    ""Эколог"",
    ""Этнограф""
  ],
  ""Педагогические"": [
    ""Воспитатель"",
    ""Дефектолог"",
    ""Кинолог"",
    ""Педагог"",
    ""Преподаватель"",
    ""Ректор"",
    ""Сурдопедагог"",
    ""Тифлопедагог"",
    ""Учитель"",
    ""Хореограф""
  ],
  ""Пищевые"": [
    ""Булочник"",
    ""Винодел"",
    ""Дегустатор"",
    ""Диетолог"",
    ""Месильщик"",
    ""Мясник"",
    ""Пекарь"",
    ""Повар"",
    ""Повар-кондитер"",
    ""Шеф-повар""
  ],
  ""Прочие"": [
    ""Промышленный альпинист""
  ],
  ""Сельское хозяйство"": [
    ""Агроном"",
    ""Ветеринар"",
    ""Доярка"",
    ""Животновод"",
    ""Охотник"",
    ""Пчеловод"",
    ""Садовник"",
    ""Тракторист"",
    ""Фермер""
  ],
  ""Сервис и обслуживание"": [
    ""Агент по туризму"",
    ""Администратор гостиницы"",
    ""Администратор ресторана"",
    ""Бармен"",
    ""Библиотекарь"",
    ""Визажист"",
    ""Гид-переводчик"",
    ""Грузчик"",
    ""Дворник"",
    ""Ивент-менеджер"",
    ""Кладовщик"",
    ""Консультант телефона доверия"",
    ""Мастер маникюра"",
    ""Мусорщик"",
    ""Оператор call-центра"",
    ""Официант"",
    ""Парикмахер"",
    ""Портье"",
    ""Почтальон"",
    ""Риелтор"",
    ""Страховой агент"",
    ""Флорист"",
    ""Экскурсовод""
  ],
  ""Спортивные"": [
    ""Спортивный инструктор по видам спорта"",
    ""Спортивный тренер"",
    ""Спортсмен""
  ],
  ""Творческие"": [
    ""Актер"",
    ""Аниматор"",
    ""Арт-директор"",
    ""Архитектор"",
    ""Бренд-дизайнер"",
    ""Диджей"",
    ""Дизайнер интерьера"",
    ""Дизайнер-модельер"",
    ""Дирижер"",
    ""Звукорежиссер"",
    ""Иллюстратор"",
    ""Каскадер"",
    ""Киномеханик"",
    ""Кинооператор"",
    ""Кинорежиссер"",
    ""Композитор"",
    ""Критик"",
    ""Ландшафтный дизайнер"",
    ""Мультипликатор"",
    ""Переводчик"",
    ""Писатель"",
    ""Продюсер"",
    ""Режиссер"",
    ""Реставратор"",
    ""Скульптор"",
    ""Стилист"",
    ""Сценарист"",
    ""Татуировщик"",
    ""Технический писатель"",
    ""Урбанист"",
    ""Фотограф"",
    ""Фотомодель"",
    ""Ювелир""
  ],
  ""Технические"": [
    ""Автомеханик"",
    ""Водолаз"",
    ""Геодезист"",
    ""Драпировщик"",
    ""Звукооператор"",
    ""Инженер по охране труда и технике безопасности"",
    ""Каменщик"",
    ""Картограф"",
    ""Крановщик"",
    ""Краснодеревщик"",
    ""Кровельщик"",
    ""Литейщик"",
    ""Маляр"",
    ""Маркшейдер"",
    ""Металлург"",
    ""Облицовщик"",
    ""Отделочник"",
    ""Плотник"",
    ""Прораб"",
    ""Слесарь"",
    ""Столяр"",
    ""Строитель"",
    ""Технолог"",
    ""Часовщик"",
    ""Электрик""
  ],
  ""Транспортные"": [
    ""Авиадиспетчер"",
    ""Автогонщик"",
    ""Бортинженер"",
    ""Бортпроводник"",
    ""Космонавт"",
    ""Летчик"",
    ""Логист"",
    ""Лоцман"",
    ""Машинист"",
    ""Стюардесса"",
    ""Таксист"",
    ""Штурман"",
    ""Экспедитор""
  ],
  ""Экономические"": [
    ""PR-менеджер"",
    ""Product-менеджер"",
    ""Аудитор"",
    ""Банкир"",
    ""Бизнес-тренер"",
    ""Бренд-менеджер"",
    ""Брокер"",
    ""Бухгалтер"",
    ""Инкассатор"",
    ""Кризис-менеджер"",
    ""Лоббист"",
    ""Маркетолог"",
    ""Менеджер"",
    ""Менеджер по логистике"",
    ""Менеджер по персоналу"",
    ""Мерчендайзер"",
    ""Налоговый инспектор"",
    ""Офис-менеджер"",
    ""Оценщик"",
    ""Продакт-менеджер"",
    ""Секретарь"",
    ""Статистик"",
    ""Супервайзер"",
    ""Товаровед"",
    ""Торговый представитель"",
    ""Трейдер"",
    ""Финансист"",
    ""Финансовый аналитик"",
    ""Экономист""
  ],
  ""Юридические"": [
    ""Адвокат"",
    ""Делопроизводитель"",
    ""Детектив"",
    ""Дипломат"",
    ""Инспектор по охране труда"",
    ""Нотариус"",
    ""Полицейский"",
    ""Правовед"",
    ""Прокурор"",
    ""Следователь"",
    ""Судебный пристав"",
    ""Судья"",
    ""Тюремный надзиратель"",
    ""Юрист""
  ]
}";
      var data = JsonSerializer.Deserialize<Dictionary<string, List<string>>>(json);
      
      foreach (var item in data)
      {
        var category = new ProfessionCategory()
        {
          Title = item.Key
        };
        Db.ProfessionCategories.Add(category);

        foreach (var title in item.Value)
        {
          var profession = new Profession()
          {
            Title = title,
            Category = category,
          };
          Db.Professions.Add(profession);
        }
      }

      Db.SaveChanges();
    }
}