<template>
    <h1 class="text-secondary">Relaks</h1>
    <q-card class="q-pa-lg">
        <q-card-section>
            <h3 class="q-mb-lg">Relationships calculations and tasks - Взаимоотношения, расчёты и задачи</h3>

            <p>
                Всем добро пожаловать в тестовый билд <b>Relaks</b>.
            </p>
            
            <ul>
                <li>Это малая часть программы для тестирования.</li>
                <li>Оффлайн, не требует установки.</li>
                <li>Можно запускать с внешнего устройства хранения данных, например USB Flash.</li>
            </ul>
            <q-separator class="q-my-lg"/>
            
            <h5 class="q-mb-lg">Объединения</h5>
            <ul>
                <li>Объединением может быть втреча, компания или человек</li>
                <li>У объединения может быть название, описание, аватар, рейтинг
                    <ul>
                        <li>текстовые заметки</li>
                        <li>телефоны</li>
                        <li>электронные почты</li>
                        <li>ссылки</li>
                        <li>даты</li>
                        <li>файловы</li>
                    </ul>
                </li>
            </ul>

            <q-separator class="q-my-lg"/>
            
            <h5 class="q-mb-lg">Дорожная карта (то, что будет реализовано)</h5>
            <ul>
                <li>Разбивка на категории(каталоги) для файлов объединений</li>
                <li>Объединение может содержать в себе другие объединения (состав компании, участники встречи)</li>
                <li>Структуры - это произвольные "иерархические блок схемы с перекрёстными связями", которые составляются из объединений, например: кто кем руководит в компании</li>
                <li>Версии для других операционных систем, например Linux и Mac</li>
            </ul>
            
            <q-separator class="q-my-lg"/>
            
            <h5 class="q-mb-lg">Информация</h5>
            <ul>
                <li>Связаться с нами можно в <a href="https://t.me/+s3jKRAu6YqJiMzUy" target="_blank">группе телеграм</a>.</li>
                <li>Программа бесплатна, поэтому не стесняйтесь <a href="https://sobe.ru/na/na_razrabotku_relaks" target="_blank">поддержать проект рублём</a>.</li>
            </ul>
        </q-card-section>
    </q-card>
    
</template>